docs/backend/faqs/specs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-06-29 Fri 16:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SPECs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="tangrammer" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">SPECs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org87cee90">1. SPECs</a>
<ul>
<li><a href="#orgc29b5c4">1.1. where to put this stuff :) ?</a></li>
<li><a href="#org7846380">1.2. Why is <code>[org.clojure/test.check "0.9.0" :scope "test"]</code> in <code>prod</code> dependencies?</a></li>
<li><a href="#orgc813a18">1.3. can <code>clojure.spec</code> check value returned by function spec(ed)?</a></li>
<li><a href="#orgba106d7">1.4. how to spec a piece of data?</a></li>
<li><a href="#orgbeaeac2">1.5. how to solve qualified keywords spec ids?</a></li>
<li><a href="#orgbc7e988">1.6. how namespaces should be aliased?</a></li>
<li><a href="#orgbd04d06">1.7. how generate sample data having specs?</a>
<ul>
<li><a href="#org4dbb8bd">1.7.1. CIDER can generate sample data from spec too</a></li>
</ul>
</li>
<li><a href="#orgd8eec1d">1.8. how to tests aggregation types?</a></li>
<li><a href="#org4204030">1.9. how to test using UI?</a>
<ul>
<li><a href="#orga52e48f">1.9.1. pivot</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org87cee90" class="outline-2">
<h2 id="org87cee90"><span class="section-number-2">1</span> SPECs</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc29b5c4" class="outline-3">
<h3 id="orgc29b5c4"><span class="section-number-3">1.1</span> where to put this stuff :) ?</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Normally clojure.specs aren't intended to be used in <code>production</code> environment, but in <code>dev</code> or <code>test</code> environment. 
So, depending of the project we could place the specs in <code>dev</code> or <code>test</code> class path folder
</p>

<p>
Sometimes we don't have the namespace that we need to internalise/identify our specs, in these cases we need the spec namespace in our src data to identify the keys as qualified keywords. Example <a href="https://github.com/akvo/akvo-lumen/blob/specs-lp-bis/backend/src/akvo/lumen/lib/aggregation.clj#L9">requiring a spec namespace in prod code</a> and <a href="https://github.com/akvo/akvo-lumen/blob/specs-lp-bis/backend/src/akvo/lumen/lib/aggregation.clj#L17">using this ns spec to identify the prod data</a>
</p>
</div>
</div>

<div id="outline-container-org7846380" class="outline-3">
<h3 id="org7846380"><span class="section-number-3">1.2</span> Why is <code>[org.clojure/test.check "0.9.0" :scope "test"]</code> in <code>prod</code> dependencies?</h3>
<div class="outline-text-3" id="text-1-2">
<p>
the only reason to have this <code>test</code> dependency in <code>prod</code> side is to be able to <a href="https://clojure.org/guides/spec#_sampling_generators">generate samples</a> inside custom generator. <a href="https://github.com/akvo/akvo-lumen/blob/specs-lp-bis/backend/src/akvo/lumen/specs/core.clj#L22">in lumen</a>
</p>
</div>
</div>

<div id="outline-container-orgc813a18" class="outline-3">
<h3 id="orgc813a18"><span class="section-number-3">1.3</span> can <code>clojure.spec</code> check value returned by function spec(ed)?</h3>
<div class="outline-text-3" id="text-1-3">
<p>
clojure.spec only can check/instrument args in function call but <b>no</b> the value returned by the function. 
</p>

<p>
Following this <a href="https://groups.google.com/forum/#!topic/clojure/JU6EmjtbRiQ">thread</a> is not possible (using plain clojure.spec lib) but there is other option to test it <a href="https://github.com/jeaye/orchestra">https://github.com/jeaye/orchestra</a> 
</p>
</div>
</div>

<div id="outline-container-orgba106d7" class="outline-3">
<h3 id="orgba106d7"><span class="section-number-3">1.4</span> how to spec a piece of data?</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Specs usually live in same namespace as the data they are referring
</p>

<p>
Below a sample data inside a sample namespace
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #0000FF;">ns</span> <span style="color: #6434A3;">example.one</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">d</span> <span style="color: #7388D6;">{</span><span style="color: #D0372D;">:id</span> <span style="color: #008000;">"12345abcde"</span><span style="color: #7388D6;">}</span><span style="color: #707183;">)</span>

</pre>
</div>

<p>
And a sample spec namespace that defines specs for previous namespace
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #0000FF;">ns</span> <span style="color: #6434A3;">example.specs</span>
  <span style="color: #7388D6;">(</span><span style="color: #D0372D;">:require</span> <span style="color: #909183;">[</span>example.one <span style="color: #D0372D;">:as</span> one<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span>clojure.spec.alpha <span style="color: #D0372D;">:as</span> s<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #6434A3;">s</span>/<span style="color: #0000FF;">def</span> <span style="color: #006699;">::one/id</span> string?<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #6434A3;">s</span>/<span style="color: #0000FF;">def</span> <span style="color: #006699;">::one/d</span> <span style="color: #7388D6;">(</span><span style="color: #6434A3;">s</span>/keys <span style="color: #D0372D;">:req-un</span> <span style="color: #909183;">[</span><span style="color: #D0372D;">::</span><span style="color: #6434A3;">one</span><span style="color: #333333; background-color: #FFFFFF;">/</span><span style="color: #D0372D;">id</span><span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

</pre>
</div>

<p>
As you can see, specs live in its own namespace (<code>example.specs</code> in the example provided) and they refers to the data to specify using the alias namespace (<code>::one/....</code> again in the example provided)
</p>
</div>
</div>

<div id="outline-container-orgbeaeac2" class="outline-3">
<h3 id="orgbeaeac2"><span class="section-number-3">1.5</span> how to solve qualified keywords spec ids?</h3>
<div class="outline-text-3" id="text-1-5">
<p>
spec ids need to be <a href="https://clojuredocs.org/clojure.core/qualified-keyword_q">qualified keywords</a> , sometimes this requirement we'll force us to create new namespaces to allocate the specs. 
this is an <a href="https://github.com/akvo/akvo-lumen/blob/org-specs/backend/src/akvo/lumen/specs/aggregation/query.clj#L1">example of creating a ns to allocate spec</a>: in this case <a href="https://github.com/akvo/akvo-lumen/blob/6567c0a907807d586d6744a855d0b26aa1638c84/backend/src/akvo/lumen/lib/aggregation.clj#L14">query</a> as data doesn't have its own namespace but it is used from other nss as aggregation.clj 
</p>
</div>
</div>

<div id="outline-container-orgbc7e988" class="outline-3">
<h3 id="orgbc7e988"><span class="section-number-3">1.6</span> how namespaces should be aliased?</h3>
<div class="outline-text-3" id="text-1-6">
<p>
as you surely have realised, soon we could need a lot of typing to refere specs using qualified keywords &#x2026;
</p>

<div class="org-src-container">
<pre class="src src-clojure">
<span style="color: #707183;">(</span><span style="color: #6434A3;">s</span>/<span style="color: #0000FF;">def</span> <span style="color: #006699;">::akvo.lumen.library.example.one/d</span> <span style="color: #7388D6;">(</span><span style="color: #6434A3;">s</span>/keys <span style="color: #D0372D;">:req-un</span> <span style="color: #909183;">[</span><span style="color: #D0372D;">::</span><span style="color: #6434A3;">akvo.lumnen.library.one</span><span style="color: #333333; background-color: #FFFFFF;">/</span><span style="color: #D0372D;">id</span><span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

</pre>
</div>

<p>
so aliasing seems to be pretty important here
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>require '<span style="color: #7388D6;">[</span>akvo.lumen.library.example.one <span style="color: #D0372D;">:as</span> one<span style="color: #7388D6;">]</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #6434A3;">s</span>/<span style="color: #0000FF;">def</span> <span style="color: #006699;">::one/d</span> <span style="color: #7388D6;">(</span><span style="color: #6434A3;">s</span>/keys <span style="color: #D0372D;">:req-un</span> <span style="color: #909183;">[</span><span style="color: #D0372D;">::</span><span style="color: #6434A3;">one</span><span style="color: #333333; background-color: #FFFFFF;">/</span><span style="color: #D0372D;">id</span><span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

</pre>
</div>

<p>
But, a new problem appears thus if we have a medium size file, we'll soon loose the meaning of aliasing 
</p>


<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>require '<span style="color: #7388D6;">[</span>akvo.lumen.library.js.engine <span style="color: #D0372D;">:as</span> engine<span style="color: #7388D6;">]</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>require '<span style="color: #7388D6;">[</span>akvo.lumen.library.example.one <span style="color: #D0372D;">:as</span> one<span style="color: #7388D6;">]</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">... 100 LOC after</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">.....</span>

<span style="color: #707183;">(</span><span style="color: #6434A3;">s</span>/<span style="color: #0000FF;">def</span> <span style="color: #006699;">::one/d</span> <span style="color: #7388D6;">(</span><span style="color: #6434A3;">s</span>/keys <span style="color: #D0372D;">:req-un</span> <span style="color: #909183;">[</span><span style="color: #D0372D;">::</span><span style="color: #6434A3;">one</span><span style="color: #333333; background-color: #FFFFFF;">/</span><span style="color: #D0372D;">id</span> <span style="color: #D0372D;">::</span><span style="color: #6434A3;">engine</span><span style="color: #333333; background-color: #FFFFFF;">/</span><span style="color: #D0372D;">type</span><span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">ups, I totally forgot the origin of ::engine at this point :(</span>

</pre>
</div>


<p>
and/or we could face conflict naming problems
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>require '<span style="color: #7388D6;">[</span>akvo.lumen.library.js.one <span style="color: #D0372D;">:as</span> one<span style="color: #7388D6;">]</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>require '<span style="color: #7388D6;">[</span>akvo.lumen.library.example.one <span style="color: #D0372D;">:as</span> one<span style="color: #7388D6;">]</span><span style="color: #707183;">)</span>

<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">ups two clj files in differents folders with same aliasing pattern</span>

</pre>
</div>


<p>
so &#x2026; following  the first approach/patter to aliasing specs 
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span><span style="color: #0000FF;">ns</span> <span style="color: #6434A3;">akvo.lumen.specs.aggregation</span>
  <span style="color: #7388D6;">(</span><span style="color: #D0372D;">:require</span> <span style="color: #909183;">[</span>akvo.lumen.component.tenant-manager <span style="color: #D0372D;">:as</span> tenant-manager<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span>akvo.lumen.lib <span style="color: #D0372D;">:as</span> lib<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span>akvo.lumen.lib.aggregation <span style="color: #D0372D;">:as</span> lib.aggregation<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span>akvo.lumen.lib.aggregation.filter <span style="color: #D0372D;">:as</span> l.aggregation.filter<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span>akvo.lumen.lib.aggregation.pie <span style="color: #D0372D;">:as</span> l.aggregation.pie<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span>akvo.lumen.lib.aggregation.pivot <span style="color: #D0372D;">:as</span> l.aggregation.pivot<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span>akvo.lumen.lib.aggregation.utils <span style="color: #D0372D;">:as</span> l.aggregation.utils<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span>akvo.lumen.specs.aggregation.pivot.row <span style="color: #D0372D;">:as</span> a.pivot.row.s<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span>akvo.lumen.specs.aggregation.query <span style="color: #D0372D;">:as</span> aggregation.query.s<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span>akvo.lumen.specs.core <span style="color: #D0372D;">:as</span> lumen.s<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span>akvo.lumen.specs.dataset <span style="color: #D0372D;">:as</span> dataset.s<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span>akvo.lumen.specs.dataset.column <span style="color: #D0372D;">:as</span> dataset.column.s<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span>akvo.lumen.specs.db <span style="color: #D0372D;">:as</span> db.s<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span>akvo.lumen.specs.libs<span style="color: #909183;">]</span>
            <span style="color: #909183;">[</span>clojure.spec.alpha <span style="color: #D0372D;">:as</span> s<span style="color: #909183;">]</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

</pre>
</div>

<ul class="org-ul">
<li>all aliases ignore common project domain =&gt; <code>akvo.lumen</code></li>
</ul>
<p>
is also ignored
<code>[akvo.lumen.lib :as lib]</code>
</p>


<ul class="org-ul">
<li>if namespace contains only one or two nss then we use full nss</li>
</ul>
<p>
<code>[akvo.lumen.lib :as lib]</code>
<code>[akvo.lumen.lib.aggregation :as lib.aggregation]</code>
</p>

<ul class="org-ul">
<li>if namespace contains more than two nss then we contract parent ones</li>

<li>if namespace is a <code>spec</code> namespace, we ignored  <code>akvo.lumen.specs</code> and aliasing ends in <code>.s</code></li>
</ul>
<p>
=&gt; <code>[akvo.lumen.specs.aggregation.query :as aggregation.query.s]</code>
=&gt; <code>[akvo.lumen.specs.aggregation.pivot.row :as a.pivot.row.s]</code>
</p>
</div>
</div>

<div id="outline-container-orgbd04d06" class="outline-3">
<h3 id="orgbd04d06"><span class="section-number-3">1.7</span> how generate sample data having specs?</h3>
<div class="outline-text-3" id="text-1-7">
<p>
a.l.specs.core defined a <code>sample</code> function for sampling data based in spec
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #707183;">(</span>require '<span style="color: #7388D6;">[</span>akvo.lumen.specs.core <span style="color: #D0372D;">:as</span> lumen.s<span style="color: #7388D6;">]</span><span style="color: #707183;">)</span>

<span style="color: #707183;">[</span><span style="color: #D0372D;">::int-nullable</span> <span style="color: #7388D6;">(</span><span style="color: #6434A3;">lumen.s</span>/sample <span style="color: #D0372D;">::int-nullable</span><span style="color: #7388D6;">)</span><span style="color: #707183;">]</span>
</pre>
</div>

<pre class="example">
[:akvo.lumen.specs.core/int-nullable -129802810]

</pre>
</div>

<div id="outline-container-org4dbb8bd" class="outline-4">
<h4 id="org4dbb8bd"><span class="section-number-4">1.7.1</span> <a href="http://docs.cider.mx/en/latest/">CIDER</a> can generate sample data from spec too</h4>
<div class="outline-text-4" id="text-1-7-1">
<p>
<a href="http://docs.cider.mx/en/latest/miscellaneous_features/#spec-browser">http://docs.cider.mx/en/latest/miscellaneous_features/#spec-browser</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orgd8eec1d" class="outline-3">
<h3 id="orgd8eec1d"><span class="section-number-3">1.8</span> how to tests aggregation types?</h3>
<div class="outline-text-3" id="text-1-8">
<p>
define steps to try out the different types in development
</p>
</div>
</div>

<div id="outline-container-org4204030" class="outline-3">
<h3 id="org4204030"><span class="section-number-3">1.9</span> how to test using UI?</h3>
<div class="outline-text-3" id="text-1-9">
</div>
<div id="outline-container-orga52e48f" class="outline-4">
<h4 id="orga52e48f"><span class="section-number-4">1.9.1</span> pivot</h4>
<div class="outline-text-4" id="text-1-9-1">
<p>
import data file &gt; choose test/resources/pivot.css &#x2026;. make viz pivot table
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: tangrammer</p>
<p class="date">Created: 2018-06-29 Fri 16:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
